{
  "tips.title.tip": "Do you know?",
  "tips.tip.no_tips": "No tips have been loaded. Please review the configurations. ",
  "tips.tip.undead_damage": "Is duck_egg a girl or a boy? ",
  "tips.tip.poison_immune": "Remember to use the quest book~ ",
  "tips.tip.witch_conversion": "YueSha believes modpack development should be centered on modding. ",
  "tips.tip.four_eggs": "This modpack is inspired from Frost Punk. ",
  "tips.tip.nether_lava": "Evan, the eternal god. ",
  "tips.tip.east": "Credits to Lyuuke and goumo_g for creating textures and models. ",
  "tips.tip.swamp_slime": "Credits to khjxiaogu for providing development support. ",
  "tips.tip.deflect_ghast_fireballs": "Credits to Fu_Yang and 03110 for building the map. ",
  "tips.tip.shulker_armor": "The Winter Rescue is far less grinding than Terra Firma Rescue. ",
  "tips.tip.arthropods": "Ores generate with stone layers while stone layers generate with biomes. ",
  "tips.tip.fossils": "You came on a mission. ",
  "tips.tip.crouch_blocks": "The first Generator heats up the surrounding region within a radius of 8 blocks. You can upgrade its heating area. ",
  "tips.tip.smoke_bees": "The Generator is a multiblock structure. Use ponder to see how to build it. ",
  "tips.tip.lava_fuel": "If you are starving, mix some sawdust in the food. At least you can feel full this way. ",
  "tips.tip.wooden_tool_fuel": "Want some hot food? Setup a crock pot!",
  "tips.tip.scrap_nuggets": "Rye is your first crop. It is very resistant to cold. ",
  "tips.tip.piglin_gold": "White turnip is probably the only vegetable you can have in the early stage. ",
  "tips.tip.dog_health": "Click your crafting table with a Hammer, you will find a new world. ",
  "tips.tip.dog_rotten_flesh": "If you have good computer specs, we recommend installing BSL Shaders. ",
  "tips.tip.lure_animals": "Keep the hope. ",
  "tips.tip.cooked_drops": "Staying near to a campfire or a working generator can effectively keep your body temperature. ",
  "tips.tip.nether_sponge": "You can view your nutrition balance in your inventory. ",
  "tips.tip.boat_passenger": "You can raise your health limit by keeping nutrition level greater than 80%. ",
  "tips.tip.shulker_golem": "Higher sugar level will cause hunger, but it also boosts your speed.",
  "tips.tip.note_block_instrument": "Higher protein level will increase your strength.",
  "tips.tip.zombie_armor": "Remember to drink water. Make sure to purify or boil it before drinking it.",
  "tips.tip.undead_helmet": "JEI is your best buddy. Use R and U to check recipes.",
  "tips.tip.iron_golem_heal": "Some food and drinks can raise or lower your temperature.",
  "tips.tip.turtle_shell": "Rumors said dashuaibia never placed a supporting log when playing Terra Firma Craft, unless he can't help it.",
  "tips.tip.animal_growing": "Best chefs know the magic of snowballs",
  "tips.tip.blaze_snowball": "Thanks to all MoegCraft players for providing testing, suggestions, and issues.",
  "tips.tip.biome_bonemeal": "Submit an issue or suggestion at support.teammoeg.com",
  "tips.tip.biome_fishing": "You should be prepared before going into water or a snowy weather, your cloth will be soaked and start to lose it's warmth",
  "tips.tip.fishing_resources": "You can find gravel beneath icy river bed. ",
  "tips.tip.boat_jump": "The authors of this modpack also created the mod Create: Steam Powered",
  "tips.tip.creeper_cat": "Do not use Electrodynamics or Advanced Rocketry mod, it is very buggy.",
  "tips.tip.water_grass": "Spot a mammoth or tiger without good equipment? Don't hesitate, run!",
  "tips.tip.gravity_torch": "Provoking wild animals is very unwise.",
  "tips.tip.string_wool": "You can transfer heat with a Tier 2 Steam Generator.",
  "tips.tip.barrel": "The Generator and heat pipes form a heat energy network.",
  "tips.tip.job_site_dimension": "Heater Vest is the best companion for travelers.",
  "tips.tip.villager_sweat": "Try having a cup of steam~",
  "tips.tip.wandering_invis": "The hypothermia bar is inspired from the Dragonspine Mountain in Genshin Impact.",
  "tips.tip.baby_panda_slimeball": "Rumors said there are human remnants in the hollow cube of Asthenosphere under the bedrock.",
  "tips.tip.fortress_triangulation": "Do not use Survive mod, it's codes are really buggy.",
  "tips.tip.creeper_drops_disc": "Submit an issue or suggestion at support.teammoeg.com",
  "tips.tip.mooshroom_lightning": "Submit an issue or suggestion at support.teammoeg.com",
  "tips.tip.bed_explode": "Submit an issue or suggestion at support.teammoeg.com",
  "tips.tip.fall_damage_blocks": "You can talk to developers at our Discord: https://discord.gg/BWn6E94",
  "tips.tip.bed_respawn": "You can find friends to play with at our Discord: https://discord.gg/BWn6E94",
  "tips.tip.ore_tiers": "Join the Discord Server for The Winter Rescue to get updates: https://discord.gg/BWn6E94",
  "tips.tip.sponge_bucket": "If you like The Winter Rescue, consider buying us a cup of hot chocolate: https://www.patreon.com/TeamMoegProjects",
  "tips.tip.coarse_to_dirt": "If you like The Winter Rescue, consider buying us a cup of coffee: https://www.patreon.com/TeamMoegProjects",
  "tips.tip.enderman_blocks": "If you like The Winter Rescue, consider buying us a cup of tea: https://www.patreon.com/TeamMoegProjects",
  "tips.tip.dragon_blocks": "This modpack is still under beta testing. We welcome any issues. ",
  "tips.tip.piglin_repellent": "We develop projects with the intent of innovation, consider supporting us: https://www.patreon.com/TeamMoegProjects",
  "gui.tips.list.title": "Tips List",
  "gui.tips.list.search": "Search",
  "gui.tips.list.show_disabled": "Show Disabled",
  "gui.tips.list.entry.tip_id": "Tip ID: %s",
  "gui.tips.list.entry.added_by": "Added by: %s",
  "gui.tips.list.entry.copied": "Copied!",
  "gui.tips.list.entry.click_to_copy": "Click to copy ID",
  "gui.tips.list.entry.disabled": "Disabled by config!",
  "gui.tips.list.config": "Config"
}
