{
	"clue.frostedheart.crucible.clue.2_293efb899ab946c1.hint": "Потрібен блок!",
	"clue.frostedheart.iron.clue.1_6fea538c5b184ec7.hint": "Піщана цегла (предмет), а не блок",
	"clue.frostedheart.mechanical_calculator.clue.2_c6b9a2fac4b14436.desc": "Будь-яка шестерня x8",
	"clue.frostedheart.mechanical_calculator.clue.3_593d54b210e7473d.desc": "Будь-яка велика шестерня x4",
	"clue.frostedheart.mechanical_press.clue.2_f69fc49b25d14d99.desc": "Будь-яка шестерня x2",
	"clue.frostedheart.precision_mechanism.clue.2_24e463212dc74849.desc": "Будь-яка шестерня x4",
	"clue.frostedheart.split_block.clue.1_5612d1fa13a74a38.desc": "Будь-який молот",
	"clue.frostedheart.storage_drawers.clue.0_abc01458e013403c.desc": "Будь-який ящик",
	"effect.frostedheart.coke_oven.effects.0_6d782276c0774dd4.0": "Коксова піч",
	"effect.frostedheart.generator_T1.effects.2_91c6a3ae87914f7a": "Рудиментарний генератор",
	"effect.frostedheart.generator_T1.effects.2_91c6a3ae87914f7a.0": "Камін, викладений цеглою",
	"effect.frostedheart.generator_T1.effects.2_91c6a3ae87914f7a.1": "Посилений мідними пластинами, щоб зробити його довговічнішим",
	"effect.frostedheart.generator_T2.effects.0_5c48befb1df4af1": "Покращений генератор",
	"effect.frostedheart.generator_T2.effects.0_5c48befb1df4af1.0": "Цей паровий генератор робить більше, ніж просто нагріває навколишнє середовище,",
	"effect.frostedheart.generator_T2.effects.0_5c48befb1df4af1.1": "він також може забезпечити достатню кількість пари під тиском для вашої фабрики",
	"effect.frostedheart.split_block.effects.0_e5b639d249cd46dd.0": "дозволяє розколювати блоки матеріалу (залізний блок, діамантовий блок і т.д.)",
	"effect.frostedheart.steam_powerd.effects.2_8eed770cafe84d50.0": "Будь-який маховик",
	"effect.frostedheart.steam_powerd.effects.5_48ac6b57ae2145c1.0": "Будь-який паровий двигун",
	"research.frostedheart.advanced_geological_tools.desc.0": "Ці інструменти пошуку допоможуть вам знайти більше ресурсів.",
	"research.frostedheart.advanced_geological_tools.desc_alt.0": "Щоб ефективніше знаходити рудні жили, вам знадобиться геологорозвідувальний інструмент.",
	"research.frostedheart.advanced_geological_tools.name": "Геологія 101",
	"research.frostedheart.alloy_kiln.desc.0": "Піч для сплаву може виробляти металеві сплави швидше та ефективніше.",
	"research.frostedheart.alloy_kiln.desc_alt.0": "З мене досить повільних ямних печей, мені потрібен належний спеціальний пристрій для виробництва металевого сплаву.",
	"research.frostedheart.alloy_kiln.name": "Удосконалення виплавки сплавів",
	"research.frostedheart.animal_cage.desc.0": "Я змайстрував клітку і обклав її внутрішню частину підкладкою, щоб у ній було тепло. Відмінний спосіб перевозити дрібних тварин і дитинчат в цілості й безпеці!",
	"research.frostedheart.animal_cage.desc_alt.0": "Перевезення тварин на великі відстані може вимагати певних зусиль і додаткової обережності. Я маю стежити, щоб вони не втекли, а також, щоб вони не замерзли до смерті.",
	"research.frostedheart.animal_cage.name": "Затишно, як дитинча в... клітці?",
	"research.frostedheart.assembler.desc.0": "За умови достатньої потужності цей розширюваний майструвач може виконувати три записані рецепти майстрування послідовно.",
	"research.frostedheart.assembler.desc_alt.0": "Я завжди мріяв про машину, яка могла б робити все за мене...",
	"research.frostedheart.assembler.name": "Розширені можливості майстрування",
	"research.frostedheart.assembly_line.desc.0": "Формуючи конвеєр пристроїв, я можу легко автоматизувати нудну серію кроків для складання складнішої деталі чи гаджета.",
	"research.frostedheart.assembly_line.desc_alt.0": "Я помітив, що багато складних продуктів збираються поетапно, мені знадобиться конвеєр, щоб робити це більш ефективно...",
	"research.frostedheart.assembly_line.name": "Збиральна лінія",
	"research.frostedheart.banner.desc.0": "Це дослідження заборонених списків",
	"research.frostedheart.banner.desc.1": "Ви не повинні дивитися на це",
	"research.frostedheart.banner.desc.2": "Не махлюйте!",
	"research.frostedheart.banner.desc_alt.0": "",
	"research.frostedheart.banner.name": "Ви не повинні дивитися на це",
	"research.frostedheart.beehive_oven_pit.desc.0": "Піч-вулик - це закрита теплоізольована камера, яка досягає високих температур завдяки спалюванню великої кількості палива і здатна розкладати гірські породи на корисні матеріали.",
	"research.frostedheart.beehive_oven_pit.desc_alt.0": "У мене є купа нудних каменів, можливо, обробка їх високими температурами перетворить їх на щось корисне?",
	"research.frostedheart.beehive_oven_pit.name": "Термічне розкладання",
	"research.frostedheart.better_fluid_transport.desc.0": "Ці пристрої можуть переміщати рідини туди, куди я захочу!",
	"research.frostedheart.better_fluid_transport.desc_alt.0": "Щоб ефективно переміщувати рідини, мені потрібно краще розуміти їхню механіку.",
	"research.frostedheart.better_fluid_transport.name": "Покращене транспортування рідини",
	"research.frostedheart.big_mixer.desc.0": "Цей міксер промислового класу достатньо потужний, щоб впоратися з будь-яким (раціональним) рецептом.",
	"research.frostedheart.big_mixer.desc_alt.0": "Нинішня комбінація механічного змішувача та умивальника більше не може задовольнити мої зростаючі потреби, мені потрібно щось більш надійне...",
	"research.frostedheart.big_mixer.name": "Чи змішається?",
	"research.frostedheart.blast_furnace.desc.0": "Ця проста доменна піч досить міцна і довговічна, щоб плавити більшість мінералів, які я можу знайти.",
	"research.frostedheart.blast_furnace.desc_alt.0": "Щоб плавити мінерали швидше, мені потрібна міцна доменна піч.",
	"research.frostedheart.blast_furnace.name": "Доменна піч",
	"research.frostedheart.blast_furnace_upgrade.desc.0": "Ця доменна піч промислового класу здатна працювати з автоматизованим обладнанням для більш ефективного розплавлення мінералів.",
	"research.frostedheart.blast_furnace_upgrade.desc_alt.0": "Я виявив, що автоматизація має важливе значення для роботи заводу, тому вдосконалення доменної печі - хороший вибір.",
	"research.frostedheart.blast_furnace_upgrade.name": "Промислова доменна піч",
	"research.frostedheart.car_kiln.desc.0": "Я спроєктував велику автомобільну піч промислового класу, здатну обробляти як тверді, так і рідкі матеріали.",
	"research.frostedheart.car_kiln.desc_alt.0": "Час для чогось кращого, ніж моя стара добра піч-вулик.",
	"research.frostedheart.car_kiln.name": "Спікання",
	"research.frostedheart.coke_oven.desc.0": "Спеціальний пристрій для виробництва коксу, деревного вугілля та креозоту. Набагато ефективніший, ніж вугільна яма.",
	"research.frostedheart.coke_oven.desc_alt.0": "Я використовував примітивні ями для виробництва коксу та деревного вугілля, які дуже виснажливі в експлуатації і виробляють мало креозотної олії, можливо, я зможу покращити це?",
	"research.frostedheart.coke_oven.name": "Переробка вугілля",
	"research.frostedheart.create_structure.desc.0": "Тепер я можу повною мірою використовувати свою уяву для створення рухомих конструкцій!",
	"research.frostedheart.create_structure.desc_alt.0": "Було б дуже круто, якби я міг пересувати великі конструкції з блоків, але є ще кілька проблем, які потрібно вирішити...",
	"research.frostedheart.create_structure.name": "Розробка рухомих конструкцій",
	"research.frostedheart.crucible.desc.0": "Сталеплавильний тигель перетворює залізо на сталь, регулюючи вміст вуглецю в ньому. Цей міцніший і витриваліший матеріал можна використовувати в усіх сферах нашої промисловості!",
	"research.frostedheart.crucible.desc_alt.0": "Мені випадково дістався шматок чорного металу з невдалого залізного горнила. Він навіть міцніший за залізо!",
	"research.frostedheart.crucible.name": "Краще, ніж залізо?!?",
	"research.frostedheart.crushing_wheel.desc.0": "Цей подрібнювальний пристрій може подрібнювати руду більш ефективно.",
	"research.frostedheart.crushing_wheel.desc_alt.0": "Плавити цілі рудні блоки не так ефективно. Може, варто розбити їх на пил?",
	"research.frostedheart.crushing_wheel.desc_alt.1": "Мені потрібні механічні калькулятори, щоб допомогти в моїх дослідженнях.",
	"research.frostedheart.crushing_wheel.name": "Подрібнення руди",
	"research.frostedheart.electrolyzer.desc.0": "Для виплавки хімічно активних металів, таких як алюміній, традиційні методи термічного відновлення не підійдуть. Електроліз - ідеальний метод для цього завдання.",
	"research.frostedheart.electrolyzer.desc_alt.0": "Я помітив, що деякі типи руд просто зникають, коли я намагаюся плавити їх безпосередньо. Можливо, мені варто спробувати якийсь більш витончений спосіб працювати з ними?",
	"research.frostedheart.electrolyzer.name": "Виплавка активних металів",
	"research.frostedheart.electromagnetics.desc.0": "Ці генератори можуть перетворювати енергію обертання на електрику!",
	"research.frostedheart.electromagnetics.desc_alt.0": "Коли я рухав магніт всередині котушки, з'являлися іскри! Може, я зможу використати це відкриття для виробництва електроенергії?",
	"research.frostedheart.electromagnetics.desc_alt.1": "Мені потрібні механічні калькулятори, щоб допомогти в моїх дослідженнях.",
	"research.frostedheart.electromagnetics.name": "Електромагнітна індукція",
	"research.frostedheart.electron_tube.desc.0": "Хоча до створення робочого комп'ютера мені ще далеко, але ці прості логічні елементи - крок до прогресу.",
	"research.frostedheart.electron_tube.desc_alt.0": "Я сумую за відчуттям, коли про всі ці низькорівневі речі піклується бортовий комп'ютер. На жаль, доведеться відбудовувати з нуля...",
	"research.frostedheart.electron_tube.name": "Створення логічних схем",
	"research.frostedheart.enchantment_table.desc.0": "Основоположні принципи все ще збивають мене з пантелику, але тепер я можу використовувати лазурит в столі зачарування, щоб значно покращити своє спорядження!",
	"research.frostedheart.enchantment_table.desc_alt.0": "Здається, лазурит має таємничий вплив на мої інструменти... можливо, я зможу використати це для їхнього покращення?",
	"research.frostedheart.enchantment_table.name": "Мистецтво зачарування",
	"research.frostedheart.engineer.desc.0": "Ці ідеї здаються досить ґрунтовними, сподіваюся, вони трохи полегшать моє життя.",
	"research.frostedheart.engineer.desc_alt.0": "Я думав про різні гаджети для покращення якості життя.",
	"research.frostedheart.engineer.name": "Корисні гаджети",
	"research.frostedheart.fermenter.desc.0": "Я успішно ідентифікував кілька видів бактерій, які можу використовувати для різних типів ферментації. Цікаво, для чого ще я можу це використати?",
	"research.frostedheart.fermenter.desc_alt.0": "Я дізнався, що деякі рідини змінюють стан при певних температурах, чому це відбувається?",
	"research.frostedheart.fermenter.name": "Ферментація",
	"research.frostedheart.fluid_transport.desc.0": "Приємно, що ці труби міцні та довговічні.",
	"research.frostedheart.fluid_transport.desc_alt.0": "Використовувати відра для транспортування всіх цих рідин стає нудно, можливо, мені вдасться створити якусь закриту трубу для їх переміщення?",
	"research.frostedheart.fluid_transport.name": "Транспортування рідин",
	"research.frostedheart.gain_experience.desc.0": "Я можу займатися самоаналізом і здобувати знання.",
	"research.frostedheart.gain_experience.desc.1": "&aЦе нескінченне дослідження.",
	"research.frostedheart.gain_experience.name": "Саморефлексія",
	"research.frostedheart.generator_T1.desc.0": "Генератор не тільки зігріє мене, як колись багаття, але й обігріє навколишню територію! Може, тепер я зможу вирощувати якісь холодостійкі культури?",
	"research.frostedheart.generator_T1.desc.1": "Обміркуйте Енергетичне ядро, щоб отримати інструкції, як його створити.",
	"research.frostedheart.generator_T1.desc_alt.0": "Мені вдалося витягти енергетичне ядро шаттла цілим і неушкодженим, можливо, я зможу його полагодити?",
	"research.frostedheart.generator_T1.desc_alt.1": "Його початковий запас енергії вичерпався, можливо, я зможу знайти інший спосіб його живлення?",
	"research.frostedheart.generator_T1.desc_alt.2": "Якщо все піде добре, можливо, я зможу використовувати його для обігріву бази?",
	"research.frostedheart.generator_T1.name": "Перепрофілювання енергетичного ядра",
	"research.frostedheart.generator_T2.desc.0": "Ця більш досконала версія генератора може обігрівати більшу площу, а також забезпечувати подачу пари під високим тиском. Чи можу я зробити парову мережу?",
	"research.frostedheart.generator_T2.desc_alt.0": "Я добре знайомий з парою. Може, я зможу використати її для живлення Енергетичного ядра?",
	"research.frostedheart.generator_T2.name": "Генератор з паровим двигуном",
	"research.frostedheart.generator_efficiency_1.desc.0": "З новим пальником і міхами генератори можуть працювати ефективніше.",
	"research.frostedheart.generator_efficiency_1.desc_alt.0": "У міру того, як мої знання розширюються, я розумію, що краща вентиляція, а також кращий пальник можуть підвищити ефективність горіння.",
	"research.frostedheart.generator_efficiency_1.name": "Ефективність генератора 1",
	"research.frostedheart.generator_efficiency_2.desc.0": "Завдяки кращій ізоляції генератори тепер можуть працювати ефективніше.",
	"research.frostedheart.generator_efficiency_2.desc_alt.0": "Генератор - це щось на кшталт великої печі, чому б не використати технологію ізоляції від печей на генераторах?",
	"research.frostedheart.generator_efficiency_2.name": "Ефективність генератора 2",
	"research.frostedheart.generator_heat_1.desc.0": "Завдяки вдосконаленому котлу генератори можуть виробляти більше енергії.",
	"research.frostedheart.generator_heat_1.desc_alt.0": "Ідея прийшла мені в голову одразу після того, як я закінчив проєктування парової турбіни. Чому б не встановити кращі котли, щоб покращити вироблення енергії генератором без додаткових витрат на паливо?",
	"research.frostedheart.generator_heat_1.name": "Енергія генератора 1",
	"research.frostedheart.generator_regain.desc.0": "Я випадково загубив своє енергетичне ядро в морозній землі. Можливо, я зможу відновити свою пам'ять, щоб знайти його.",
	"research.frostedheart.generator_regain.desc.1": "&c&lA Команда може побудувати лише один генератор, повторно робити це безглуздо.",
	"research.frostedheart.generator_regain.desc.2": "&aЦе нескінченне дослідження.",
	"research.frostedheart.generator_regain.name": "Відновлення енергетичного ядра",
	"research.frostedheart.geology_understanding.desc.0": "Розташування пластів чітко відповідає закономірності, а розташування рудних жил, схоже, тісно пов'язане з навколишнім пластом. Тепер пошук руд має бути набагато простішим!",
	"research.frostedheart.geology_understanding.desc_alt.0": "Я безцільно полював за рудними жилами. Має ж бути якийсь спосіб легше їх знайти... може, час вирушити на екскурсію?",
	"research.frostedheart.geology_understanding.name": "Розуміння прошарків",
	"research.frostedheart.hand_warmer.desc.0": "Я ретельно розробив ручну піч, за допомогою якої я можу підтримувати тліюче паливо як безпечне і зручне портативне джерело тепла.",
	"research.frostedheart.hand_warmer.desc_alt.0": "Носити з собою розпалене багаття може бути не найкращою ідеєю... Цікаво, чи можу я зробити щось тепле, щоб потримати?",
	"research.frostedheart.hand_warmer.name": "Портативне джерело тепла",
	"research.frostedheart.heat_incubator.desc.0": "З паровим інкубатором вирощувати гриби набагато простіше.",
	"research.frostedheart.heat_incubator.desc_alt.0": "Використовувати негашене вапно для живлення інкубаторів трохи дорого. Можливо, я зможу нагріти його теплом.",
	"research.frostedheart.heat_incubator.name": "Покращений інкубатор",
	"research.frostedheart.heating_basin.desc.0": "Я з'ясував, як забезпечити тепло під час змішування, це так само просто, як розмістити джерело тепла під чашею.",
	"research.frostedheart.heating_basin.desc_alt.0": "Іноді для досягнення різних реакцій потрібне тепло. Чи можу я нагріти чашу безпосередньо?",
	"research.frostedheart.heating_basin.desc_alt.1": "Мені потрібні механічні калькулятори, щоб допомогти в моїх дослідженнях.",
	"research.frostedheart.heating_basin.name": "Нагрівання та змішування",
	"research.frostedheart.heating_vest.desc.0": "Я повинен покласти жилет у задній слот курйоз, щоб він не пошкодився, як моя броня. Він добре зігріває навіть у найсуворіших умовах, я просто повинен тримати його повним.",
	"research.frostedheart.heating_vest.desc_alt.0": "Який найкращий спосіб зігрітися, навіть у розпал жахливої хуртовини? Хмммм, НОСІННЯ ПАРИ?",
	"research.frostedheart.heating_vest.name": "Жилет-обігрівач",
	"research.frostedheart.improve_energy.desc.0": "Трохи попрактикувавшись, я навчився деяким хитрощам у написанні статей.",
	"research.frostedheart.improve_energy.desc_alt.0": "У мене проблема з браком натхнення. Можливо, варто витратити трохи часу на вдосконалення своїх здібностей.",
	"research.frostedheart.improve_energy.name": "Практика роботи з документами",
	"research.frostedheart.incubator.desc.0": "З цим пристроєм мені легше вирощувати гриби. ",
	"research.frostedheart.incubator.desc.1": "Хоча мені знадобиться багато негашеного вапна, щоб запустити його.",
	"research.frostedheart.incubator.desc_alt.0": "Хоча брати з собою грибницю зручно, вона займає багато місця в моєму інвентарі.",
	"research.frostedheart.incubator.desc_alt.1": "Мені потрібен стаціонарний грибний інкубатор.",
	"research.frostedheart.incubator.name": "Інкубація грибів",
	"research.frostedheart.industrial_electrolyzer.desc.0": "Маючи можливість виготовляти графітові електроди, ми можемо створити кращий електролізер.",
	"research.frostedheart.industrial_electrolyzer.desc_alt.0": "Графіт - ідеальний матеріал для електродів: чудова електропровідність, хороша термостійкість, і він не так легко окислюється.",
	"research.frostedheart.industrial_electrolyzer.name": "Електродний прорив",
	"research.frostedheart.iron.desc.0": "Сиродутне горно! Це те, що мені було потрібно для проведення реакції. Ось воно, залізо! Тепер я відчуваю себе цивілізованим!",
	"research.frostedheart.iron.desc_alt.0": "Я пам'ятаю, що для отримання заліза з його оксиду потрібне тепло і відновник. Хоча на практиці це може бути набагато складніше.",
	"research.frostedheart.iron.name": "Придбання обладнання",
	"research.frostedheart.lining_upgrade.desc.0": "Підкладка на моїй броні призведе до того, що обидві втратять міцність, коли я отримаю ушкодження, сподіваюсь, це тимчасове рішення.",
	"research.frostedheart.lining_upgrade.desc_alt.0": "Обирати між теплом і захистом у такому ворожому середовищі досить страшно, але що я міг зробити?",
	"research.frostedheart.lining_upgrade.name": "Тепла підкладка",
	"research.frostedheart.mechanical_bellows.desc.0": "Що ж, це розчаровує... редстоун не може забезпечити навіть початковий стартовий стрес 1su. Мені потрібно буде знайти інше рішення ...",
	"research.frostedheart.mechanical_bellows.desc_alt.0": "Зменшення ручної праці має важливе значення для прогресу, і мені потрібно знайти джерело надійного початкового напруження для сильфона, можливо, Редстоун зробить трюк?",
	"research.frostedheart.mechanical_bellows.name": "Механічний міхи",
	"research.frostedheart.mechanical_calculator.desc.0": "Невеличкий калькулятор, хоч і грубий, але тепер більше не потрібно постійно сидіти за креслярським столом. Зачекай... знову не так? Тепер я маю сидіти біля калькулятора? Я так довго налаштовую цей калькулятор. Може, не так багато натхнення, але енергію він забирає по-справжньому. Що? Деплойдер? Ця штука хороша, доки вона не додає більше клопоту. Вона лише зробить неправильні дані хаотичними і марними...",
	"research.frostedheart.mechanical_calculator.desc_alt.0": "Тупик, тупик, тупик, тупик, всі тупики... Стоячи на плечі велетня, можливо, не буде видно далі, але, можливо, буде важче впасти. Якби існував якийсь пристрій, що допоміг би мені в цьому натхненному дослідницькому процесі... Не зважайте, це щось нерозв'язане, навіть коли наука на піку свого розвитку. Але має бути якийсь метод, щоб зберегти мої сили...",
	"research.frostedheart.mechanical_calculator.name": "Посилення досліджень",
	"research.frostedheart.mechanical_crafter.desc.0": "Механічний майструвач, який використовує напругу, щоб зібрати сировину за певною схемою. Чудово, але забирає надто багато сил, не підходить для автоматизації. Можливо, тільки в центрі виробництва для великих машин.",
	"research.frostedheart.mechanical_crafter.desc_alt.0": "Верстак ось такого розміру. Але більший мені не підходить... Я не можу ним користуватися. Якби було щось, що може автоматично виконувати якісь крафтові процедури, це було б чудово. Щоб я міг спробувати будувати якісь складні конструкції.",
	"research.frostedheart.mechanical_crafter.name": "Механічне виробництво",
	"research.frostedheart.mechanical_press.desc.0": "Перетворення обертання на удар тиску ефективно вирішує проблему прокатки. Тому я назвав його вальцювальним верстатом. Але, навіть якщо це підвищує ефективність використання матеріалу, деякі кутові матеріали все одно втрачаються. Техніка холодної обробки металу не повинна закінчуватися на цьому. ",
	"research.frostedheart.mechanical_press.desc_alt.0": "Бити залізом по колоді (чому вона не ламається?) - не найкраща техніка обробки металу. Зрештою, пріоритет - звільнити руки? Чому б мені не спробувати використати іншу силу для обробки металу?",
	"research.frostedheart.mechanical_press.name": "Механічне холодне лиття",
	"research.frostedheart.mechanical_saw.desc.0": "Я сконструював пильний диск і встановив його на столі. Тепер, просто пересуваючи об'єкт по пилці, що обертається, я можу зробити все, що захочу. Чудово!",
	"research.frostedheart.mechanical_saw.desc_alt.0": "Обробляти колоди вручну клопітно і насправді вимагає певної... майстерності. Я робив жахливу роботу: якщо я використовую сокиру, то іноді можу виготовити лише жахливі вироби, які, можливо, можна використати лише як паливо; якщо я використовую пилку, то це коштуватиме більше часу, з чим я можу змиритися...",
	"research.frostedheart.mechanical_saw.name": "Обробка колод",
	"research.frostedheart.mechanics_measurement.desc.0": "Оглядова перевірка - це хороша стратегія для перевірки помилок. Але наразі нам потрібно перевірити швидкість і стрес. Я сподіваюся, що ці два зможуть підтримувати нашу стрес-мережу в робочому стані. Але це лише надія.",
	"research.frostedheart.mechanics_measurement.desc_alt.0": "Обертається, обертається, обертається, так, чудово, він обертається... чому він знову зупинився? Перезавантажити! Що, чому зубчасте колесо зламалося... Мені потрібно щось, щоб перевірити, що не так!",
	"research.frostedheart.mechanics_measurement.name": "Дивіться «Вимірник»!",
	"research.frostedheart.mechanics_tools.desc.0": "Гайковий ключ - чудовий інструмент. Він ефективно дозволяє мені регулювати напрямок пристроїв, заощаджуючи багато часу. Окуляри надають первинну інформацію про сучасні пристрої. Принаймні, я можу досліджувати проблеми у своїх проектах. ",
	"research.frostedheart.mechanics_tools.desc_alt.0": "Знову все змінилося!!! Якщо є інструмент для точного налаштування поточних пристроїв без їх заміни, це було б супер.",
	"research.frostedheart.mechanics_tools.name": "Інженерне обладнання",
	"research.frostedheart.metal_press.desc.0": "Я вважаю, що це найкращий дизайн для сучасної холодної техніки. Хоча це повільніше, але я можу робити не тільки пластини, я можу робити дріт, стрижні і навіть гільзи з подібним дизайном. Але якщо я хочу ще більше підвищити ефективність, щоб запобігти поломкам, гаряча обробка є обов'язковою.",
	"research.frostedheart.metal_press.desc_alt.0": "Прокатний верстат - хороший пристрій для холодної обробки металу. Але через свою нестабільність він здебільшого призводить до втрат матеріалу. Якщо ми якось зафіксуємо матеріал і використаємо форму для його контролю, ми зможемо підвищити ефективність обробки металу.",
	"research.frostedheart.metal_press.name": "Натискання",
	"research.frostedheart.millstone.desc.0": "Використання сили обертання для подрібнення предметів виснажливе, але це найкращий метод, який я маю на даний момент...",
	"research.frostedheart.millstone.desc_alt.0": "Ручне подрібнення матеріалів дає не так багато, як я сподівався, можливо, я можу це якось автоматизувати?",
	"research.frostedheart.millstone.name": "Подрібнення",
	"research.frostedheart.mixer.desc.0": "Перемішати яйце, ну, добре, але не більше. Перемішування здебільшого рівномірне, але шукати справжню однорідність - це нонсенс. Мені потрібно знайти кращу машину для цього.",
	"research.frostedheart.mixer.desc_alt.0": "Комбіновані матеріали - це те, що я завжди шукав, але для того, щоб змішати їх разом, потрібен процес. Найпоширеніші способи потребують високої температури, води тощо. Гаразд, ці методи я не можу перевірити зараз. Я просто хочу отримати трохи цегли, можливо, яєчний міксер буде гарним вибором.",
	"research.frostedheart.mixer.name": "Змішування",
	"research.frostedheart.multiblock_structure.desc.0": "Тепер я можу почати будувати великі машини, використовуючи ці стандартні конструктивні елементи!",
	"research.frostedheart.multiblock_structure.desc_alt.0": "Мені потрібні більші машини, щоб масштабувати виробництво...",
	"research.frostedheart.multiblock_structure.name": "Промислові структури",
	"research.frostedheart.precision_mechanism.desc.0": "Що ж, це вдається, використання електричних трубок для керування передавальними пристроями справді можливе. Але ця ціна просто нестерпна. Якби існував якийсь дешевший спосіб керування сигналом, це було б краще. Зрештою, потужність Редстоуна надто мала. Зміна швидкості - це моя творча межа.",
	"research.frostedheart.precision_mechanism.desc_alt.0": "Для деяких верстатів лише зубчасті колеса не можуть задовольнити мої вимоги. Мені потрібні більш точні конструкції. Але маленькі зубчасті колеса важко виготовити. Але якщо ми використаємо сигнал червоного каменю, щоб замінити точність, яку дають зубчасті колеса? ",
	"research.frostedheart.precision_mechanism.name": "Технологія точного виробництва",
	"research.frostedheart.prospecting_upgrade.name": "Оновлення геологорозвідки",
	"research.frostedheart.rotary_kiln.desc.0": "Обертова піч ідеально підходить для випалу великих партій. Вона навіть збирає всі рідини, що утворюються в процесі переробки!",
	"research.frostedheart.rotary_kiln.desc_alt.0": "Мій поточний попит на деревне вугілля набагато перевищує поточний метод виробництва... Цікаво, чи можу я вдосконалити його, використовуючи якусь довгу нагріту циліндричну посудину, що обертається під нахилом?",
	"research.frostedheart.rotary_kiln.name": "Обертова піч",
	"research.frostedheart.rubbing_tool.desc.0": "За допомогою притирального інструменту я можу робити машини без інтелектуального управління і записувати дані з механічних калькуляторів.",
	"research.frostedheart.rubbing_tool.desc_alt.0": "Я якось втомився самостійно керувати і записувати дані з механічного калькулятора.",
	"research.frostedheart.rubbing_tool.desc_alt.1": "Мені потрібні механічні калькулятори, щоб допомогти в моїх дослідженнях.",
	"research.frostedheart.rubbing_tool.name": "Інструмент для натирання",
	"research.frostedheart.sauna_vent.desc.0": "Тепер я можу зробити закриту кімнату і наповнити її парою, щоб оздоровити своє тіло.",
	"research.frostedheart.sauna_vent.desc_alt.0": "Я вже дізнався, що тепло може передаватися від пари, але як щодо безпосереднього контакту з парою?",
	"research.frostedheart.sauna_vent.name": "Надійність сауни",
	"research.frostedheart.simple_machines.desc.0": "Млин і прес - чудові машини, але тільки для обертання. Для нашої системи цього все ще трохи не вистачає. Якби потужність обертання можна було змінити на інші види енергії, було б ще краще. ",
	"research.frostedheart.simple_machines.desc_alt.0": "Коли передача обертання більше не є проблемою, я також повинен розглянути можливість додати ці механізми обертання до моєї стресової системи.",
	"research.frostedheart.simple_machines.name": "Проста техніка",
	"research.frostedheart.soil_thermometer.desc.0": "Не вдається, дуже шкода. Невелике підвищення температури, принесене теплою погодою, не може втримати ці культури в рості. Можливо, коли вони виростуть, мене теж вдасться успішно заморити голодом.",
	"research.frostedheart.soil_thermometer.desc_alt.0": "Через цей дивний клімат важко визначити, коли саджати зернові культури. Очевидно, що їсти лише рибу недостатньо, щоб підтримувати необхідний рівень харчування. Мені потрібно знайти спосіб боротися з погодою. ",
	"research.frostedheart.soil_thermometer.name": "Рівень розмерзання ґрунту",
	"research.frostedheart.split_block.desc.0": "Мабуть, можливо, на сьогоднішній день створення блоків - моя найкраща техніка стиснення. Але тільки деякі матеріали можна зліпити в блоки. Я не можу спресувати бруд або бруківку. N-й день без цифрового сховища. Сумую за цим. ",
	"research.frostedheart.split_block.desc_alt.0": "Без цифрової системи зберігання, щоб краще зберігати матеріали, необхідна якісна та надійна підшивка. Але в той же час, якщо я знайду правильний метод стиснення, чи зможе він підвищити ефективність мого зберігання? ",
	"research.frostedheart.split_block.name": "Інструменти розділення блоків",
	"research.frostedheart.squeezer.desc.0": "І це вдається? Якщо не брати до уваги величезну втрату енергії, я б дуже хотів користуватися штучними засобами. Але зараз я не маю такої сили напруги. Я можу лише накопичувати електроенергію і давати її машинам, тож вони можуть забезпечити величезну силу віджиму. Але споживання все одно надто велике. Якщо віджимання не є необхідним, я б не хотів його використовувати. ",
	"research.frostedheart.squeezer.desc_alt.0": "Для того, щоб витягти деякі рідини з рослин, я намагався використовувати млин і дробильні колеса, щоб вичавити їх. Але, окрім того, що вони ламаються, я не можу досягти інших результатів. Тому я намагаюся використовувати більші машини для кращої техніки вилучення.",
	"research.frostedheart.squeezer.name": "Промисловий віджимач",
	"research.frostedheart.steam_heater.desc.0": "Розподіляючи тепло через випромінювання пари, я можу побудувати кілька псевдогенераторів. Але споживання набагато більше, ніж у зарядних пристроїв. Можливо, настав час дослідити наступне покоління генераторів. Але, в будь-якому випадку, я не маю кращих методів обігріву зараз...",
	"research.frostedheart.steam_heater.desc_alt.0": "Від людей, для людей. Можливо, паровий зарядник - це хороший спосіб споживання тепла. Але мій справжній інтерес у створенні генератора полягає не в тому, щоб приготувати їжу чи зробити жилет для обігріву. Насправді я хочу мати кращі сільськогосподарські та фермерські регіони. Якщо я зможу використати це тепло, щоб зробити кілька «псевдогенераторів», це буде дійсно чудово...",
	"research.frostedheart.steam_heater.name": "Радіатор опалення",
	"research.frostedheart.steam_powerd.desc.0": "Наразі парові двигуни чудово справляються зі створенням необхідного напруження. Можливі й більші парові двигуни, але у мене немає стільки тепла, щоб їх запустити. Зараз у мене є базовий двигун. Його вистачає для моїх поточних потреб. ",
	"research.frostedheart.steam_powerd.desc_alt.0": "Кип'ятіння води є найсуттєвішим прикладом людської цивілізації. Це також важливий фундамент для перетворення релігійного служіння на наукове дослідження. Але як кип'ятити воду, щоб краще забезпечувати енергією - це складне і серйозне питання. ",
	"research.frostedheart.steam_powerd.name": "Паровий завод",
	"research.frostedheart.steam_turbine.desc.0": "Якщо я об'єднаю напружувальний пристрій і пристрій для генерації електроенергії, я зможу уникнути втрат при передачі електроенергії. Тим часом, оскільки пристрій для вимірювання напруги знаходиться всередині пристрою для виробництва електроенергії, я можу використати кращу структуру, щоб значно зменшити споживання електроенергії, виробляючи при цьому вищу напругу. Але парові котли все одно є обмеженими джерелами. Необхідно терміново розглянути можливість використання нових напружувальних пристроїв або більших котлів.",
	"research.frostedheart.steam_turbine.desc_alt.0": "Перетворення енергії обертання в електричну енергію може перетворити енергію, яку неможливо зберігати, в енергію, яку можна зберігати. Але серйозна проблема полягає в тому, що поточний ККД є надто низьким. Якщо я зможу підвищити ефективність, я зможу зменшити свою залежність від палива. ",
	"research.frostedheart.steam_turbine.name": "Парова турбіна",
	"research.frostedheart.stering_generator.desc.0": "Оскільки він невеликий за розміром і потужний у використанні, я вирішив назвати його «парове ядро»",
	"research.frostedheart.stering_generator.desc_alt.0": "Можливо, я зможу використовувати енергію, вироблену генератором, для створення сили обертання.",
	"research.frostedheart.stering_generator.name": "Генератор Стірлінга",
	"research.frostedheart.storage_bucket.desc.0": "Після ретельного дослідження, дерев'яна бочка обов'язково стає для мене пристроєм для зберігання. У ній можна зберігати те саме, що й у скрині, але вона потребує бронзової пластини, щоб утримувати її на місці. Занадто дорого... Треба швидше дістати верстак. ",
	"research.frostedheart.storage_bucket.desc_alt.0": "Наразі виготовлення скрині для мене занадто складне завдання. Але мої речі вже не поміщаються в інвентарні та кам'яні скрині. Тепер мені потрібен пристрій, який не потребує верстака для крафту, щоб зберігати мої речі. Чи можливо це зробити? ",
	"research.frostedheart.storage_bucket.name": "Покращене зберігання",
	"research.frostedheart.storage_drawers.desc.0": "Компактні шухляди - це добре, але хотілося б мати щось, щоб ними керувати. З очей геть, з серця геть.",
	"research.frostedheart.storage_drawers.desc_alt.0": "Простого стиснення матеріалів у блоки недостатньо, щоб компенсувати брак місця для зберігання. Цікаво, чи можу я стиснути їх ще більше?",
	"research.frostedheart.storage_drawers.name": "Компактне сховище",
	"research.frostedheart.tetra.desc.0": "Верстак, присвячений вдосконаленню моїх інструментів, можливо, тепер я зможу видобувати твердіші блоки своїм бронзовим кайлом.",
	"research.frostedheart.tetra.desc_alt.0": "Звичайних інструментів недостатньо, мені потрібно спробувати розробити кращий метод створення та вдосконалення інструментів.",
	"research.frostedheart.tetra.name": "Наточіть свої інструменти!",
	"research.frostedheart.thermos_T1.desc.0": "Змайструвавши термос, можна зберегти воду теплою протягом пристойного часу. Що завгодно заради невеликої переваги в цій обмороженій пустелі...",
	"research.frostedheart.thermos_T1.desc_alt.0": "Використовувати ці дерев'яні чашки не дуже розумно... було б добре мати більшу версію, яка б не займала стільки місця на складі.",
	"research.frostedheart.thermos_T1.name": "Термос",
	"research.frostedheart.thermos_T2.desc.0": "Цей металевий термос вдвічі більший за оригінал.",
	"research.frostedheart.thermos_T2.desc_alt.0": "Мені потрібно досліджувати далі, щоб знайти те, що мені потрібно, але я все ще обмежений тим, скільки води може вмістити термос.",
	"research.frostedheart.thermos_T2.name": "Удосконалений термос",
	"research.frostedheart.transmission_machinery.desc.0": "Обертати все вручну - це виснажливо... Треба знайти кращий спосіб це робити.",
	"research.frostedheart.transmission_machinery.desc_alt.0": "Обертальна сила, безсумнівно, є найкращим методом передачі стресу. Можливо, я зможу розподілити зусилля більш рівномірно і робити дві речі одночасно?",
	"research.frostedheart.transmission_machinery.name": "Трансмісійне обладнання",
	"research.frostedheart.water_purifier.desc.0": "Очистити воду за допомогою вугільних фільтрів відносно легко, і вона відповідає питним стандартам, хоча і є досить холодною.",
	"research.frostedheart.water_purifier.desc_alt.0": "Вручну кип'ятити воду досить громіздко і довго, якість нормальна... але трохи солонувата.",
	"research.frostedheart.water_purifier.name": "Фільтрація води",
	"research.frostedheart.wool_armor.desc.0": "Вовна здається найкращим варіантом, доступним на даний момент, мені доведеться знайти спосіб одомашнити овець.",
	"research.frostedheart.wool_armor.desc_alt.0": "Наближається хуртовина, і цей примітивний одяг довго не протримається... Мені потрібно знайти більш теплі варіанти одягу.",
	"research.frostedheart.wool_armor.name": "Вовняний одяг",
	"research.frostedheart.wool_lining.desc.0": "Це трохи кращий варіант, він схожий на звичайну вовняну підкладку, але його довговічність набагато вища.",
	"research.frostedheart.wool_lining.desc_alt.0": "Вовняна підкладка не забезпечує особливого захисту в бійці.",
	"research.frostedheart.wool_lining.name": "Вовняна підкладка",
	"research.frostedheart.workbench.desc.0": "Нарешті у мене з'явився верстак! Тепер я можу робити двері, скрині та багато іншого! Можливості безмежні!",
	"research.frostedheart.workbench.desc_alt.0": "Сьогодні, мабуть, чудовий день: Я дістав залізо і кращі дошки - отже, під дією холодної температури верстак більше не повинен зламатися. Тож почну зараз!",
	"research.frostedheart.workbench.name": "Техніки створення"
}